davidLee-cs/pcr_Control/spi_ex1_loopback.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "F2837xS" --part "F2837xS_176PTP" --package "F2837xS_176PTP" --context "system" --product "C2000WARE@5.04.00.00"
 * @v2CliArgs --device "TMS320F28377S" --package "176PTP" --context "system" --product "C2000WARE@5.04.00.00"
 * @versions {"tool":"1.22.0+3893"}
 */

/**
 * Import the modules used in this configuration.
 */
const epwm   = scripting.addModule("/driverlib/epwm.js", {}, false);
const epwm1  = epwm.addInstance();
const epwm2  = epwm.addInstance();
const epwm3  = epwm.addInstance();
const epwm4  = epwm.addInstance();
const gpio   = scripting.addModule("/driverlib/gpio.js", {}, false);
const gpio1  = gpio.addInstance();
const gpio2  = gpio.addInstance();
const gpio3  = gpio.addInstance();
const gpio4  = gpio.addInstance();
const gpio5  = gpio.addInstance();
const gpio6  = gpio.addInstance();
const gpio7  = gpio.addInstance();
const gpio8  = gpio.addInstance();
const gpio9  = gpio.addInstance();
const gpio10 = gpio.addInstance();
const gpio11 = gpio.addInstance();
const gpio12 = gpio.addInstance();
const gpio13 = gpio.addInstance();
const gpio14 = gpio.addInstance();
const gpio15 = gpio.addInstance();
const gpio16 = gpio.addInstance();
const gpio17 = gpio.addInstance();
const gpio18 = gpio.addInstance();
const sci    = scripting.addModule("/driverlib/sci.js", {}, false);
const sci1   = sci.addInstance();
const sci2   = sci.addInstance();
const sci3   = sci.addInstance();
const sci4   = sci.addInstance();
const spi    = scripting.addModule("/driverlib/spi.js", {}, false);
const spi1   = spi.addInstance();
const spi2   = spi.addInstance();
const spi3   = spi.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
epwm1.$name                            = "myStepMotorEPWM4";
epwm1.epwmEventTrigger_enableInterrupt = true;
epwm1.epwmEventTrigger_interruptSource = "EPWM_INT_TBCTR_ZERO";
epwm1.epwm.$assign                     = "EPWM4";
epwm1.epwm.epwm_aPin.$assign           = "GPIO6";
epwm1.epwm.epwm_bPin.$assign           = "GPIO7";

epwm2.$name                  = "myStepMotorEPWM3";
epwm2.epwm.$assign           = "EPWM3";
epwm2.epwm.epwm_aPin.$assign = "GPIO4";
epwm2.epwm.epwm_bPin.$assign = "GPIO5";

epwm3.$name                  = "myStepMotorEPWM2";
epwm3.epwm.$assign           = "EPWM2";
epwm3.epwm.epwm_aPin.$assign = "GPIO2";
epwm3.epwm.epwm_bPin.$assign = "GPIO3";

epwm4.$name                  = "myStepMotorEPWM1";
epwm4.epwm.$assign           = "EPWM1";
epwm4.epwm.epwm_aPin.$assign = "GPIO0";
epwm4.epwm.epwm_bPin.$assign = "GPIO1";

gpio1.$name             = "ADC_CS_1";
gpio1.direction         = "GPIO_DIR_MODE_OUT";
gpio1.writeInitialValue = true;
gpio1.initialValue      = 1;
gpio1.gpioPin.$assign   = "GPIO55";

gpio2.$name           = "ADC_Start_1";
gpio2.direction       = "GPIO_DIR_MODE_OUT";
gpio2.gpioPin.$assign = "GPIO56";

gpio3.$name           = "ADC_Reset";
gpio3.gpioPin.$assign = "GPIO9";

gpio4.$name           = "RTD_Sel0";
gpio4.direction       = "GPIO_DIR_MODE_OUT";
gpio4.gpioPin.$assign = "GPIO64";

gpio5.$name           = "RTD_Sel1";
gpio5.direction       = "GPIO_DIR_MODE_OUT";
gpio5.gpioPin.$assign = "GPIO65";

gpio6.$name           = "ADC_DRDY_1";
gpio6.gpioPin.$assign = "GPIO49";

gpio7.$name           = "LED_RED";
gpio7.direction       = "GPIO_DIR_MODE_OUT";
gpio7.gpioPin.$assign = "GPIO53";

gpio8.$name           = "DIR_0";
gpio8.direction       = "GPIO_DIR_MODE_OUT";
gpio8.gpioPin.$assign = "GPIO30";

gpio9.$name             = "ENABLE_0";
gpio9.direction         = "GPIO_DIR_MODE_OUT";
gpio9.writeInitialValue = true;
gpio9.gpioPin.$assign   = "GPIO92";

gpio10.$name             = "SPI_SS_0";
gpio10.direction         = "GPIO_DIR_MODE_OUT";
gpio10.writeInitialValue = true;
gpio10.initialValue      = 1;
gpio10.gpioPin.$assign   = "GPIO19";

gpio11.$name           = "DAC_CLR";
gpio11.direction       = "GPIO_DIR_MODE_OUT";
gpio11.gpioPin.$assign = "GPIO62";

gpio12.$name           = "DAC_LOAD";
gpio12.direction       = "GPIO_DIR_MODE_OUT";
gpio12.gpioPin.$assign = "GPIO63";

gpio13.$name             = "DAC_SPI_SS";
gpio13.direction         = "GPIO_DIR_MODE_OUT";
gpio13.writeInitialValue = true;
gpio13.initialValue      = 1;
gpio13.gpioPin.$assign   = "GPIO59";

gpio14.direction         = "GPIO_DIR_MODE_OUT";
gpio14.$name             = "FAN_0";
gpio14.writeInitialValue = true;
gpio14.gpioPin.$assign   = "GPIO80";

gpio15.$name             = "FAN_1";
gpio15.direction         = "GPIO_DIR_MODE_OUT";
gpio15.writeInitialValue = true;
gpio15.gpioPin.$assign   = "GPIO81";

gpio16.$name             = "FAN_2";
gpio16.direction         = "GPIO_DIR_MODE_OUT";
gpio16.writeInitialValue = true;
gpio16.gpioPin.$assign   = "GPIO82";

gpio17.$name             = "FAN_3";
gpio17.direction         = "GPIO_DIR_MODE_OUT";
gpio17.writeInitialValue = true;
gpio17.gpioPin.$assign   = "GPIO83";

gpio18.$name             = "FAN_4";
gpio18.direction         = "GPIO_DIR_MODE_OUT";
gpio18.writeInitialValue = true;
gpio18.gpioPin.$assign   = "GPIO85";

sci1.baudRates             = 9600;
sci1.$name                 = "BOOT_SCI";
sci1.sci.$assign           = "SCIA";
sci1.sci.scirxdPin.$assign = "GPIO28";
sci1.sci.scitxdPin.$assign = "GPIO29";
sci1.rxQual.$name          = "myGPIOQUAL12";
sci1.txQual.$name          = "myGPIOQUAL13";

sci2.$name                 = "BARCODE_SCI";
sci2.baudRates             = 9600;
sci2.sci.$assign           = "SCIC";
sci2.sci.scirxdPin.$assign = "GPIO39";
sci2.sci.scitxdPin.$assign = "GPIO38";
sci2.rxQual.$name          = "myGPIOQUAL14";
sci2.txQual.$name          = "myGPIOQUAL15";

sci3.$name        = "RS485_SCI";
sci3.baudRates    = 9600;
sci3.sci.$assign  = "SCIB";
sci3.rxQual.$name = "myGPIOQUAL16";
sci3.txQual.$name = "myGPIOQUAL17";

sci4.$name                 = "UART_TTL";
sci4.baudRates             = 9600;
sci4.sci.$assign           = "SCID";
sci4.sci.scirxdPin.$assign = "GPIO77";
sci4.sci.scitxdPin.$assign = "GPIO76";
sci4.rxQual.$name          = "myGPIOQUAL18";
sci4.txQual.$name          = "myGPIOQUAL19";

spi1.$name                   = "mySPI0";
spi1.useInterrupts           = false;
spi1.mode                    = "SPI_MODE_CONTROLLER";
spi1.bitRate                 = 2000000;
spi1.emulationMode           = "SPI_EMULATION_FREE_RUN";
spi1.dataWidth               = "8";
spi1.useFifo                 = false;
spi1.spi.$assign             = "SPIC";
spi1.spi.spi_picoPin.$assign = "GPIO50";
spi1.spi.spi_pociPin.$assign = "GPIO51";
spi1.spi.spi_clkPin.$assign  = "GPIO52";
spi1.picoQual.$name          = "myGPIOQUAL0";
spi1.pociQual.$name          = "myGPIOQUAL1";
spi1.clkQual.$name           = "myGPIOQUAL2";
spi1.pteQual.$name           = "myGPIOQUAL3";

spi2.$name                   = "mySPI1";
spi2.useFifo                 = false;
spi2.useInterrupts           = false;
spi2.mode                    = "SPI_MODE_CONTROLLER";
spi2.emulationMode           = "SPI_EMULATION_FREE_RUN";
spi2.dataWidth               = "8";
spi2.spi.$assign             = "SPIA";
spi2.spi.spi_picoPin.$assign = "GPIO16";
spi2.spi.spi_pociPin.$assign = "GPIO17";
spi2.spi.spi_clkPin.$assign  = "GPIO18";
spi2.picoQual.$name          = "myGPIOQUAL4";
spi2.pociQual.$name          = "myGPIOQUAL5";
spi2.clkQual.$name           = "myGPIOQUAL6";
spi2.pteQual.$name           = "myGPIOQUAL7";

spi3.$name                   = "mySPI2";
spi3.useFifo                 = false;
spi3.useInterrupts           = false;
spi3.dataWidth               = "8";
spi3.mode                    = "SPI_MODE_CONTROLLER";
spi3.emulationMode           = "SPI_EMULATION_FREE_RUN";
spi3.spi.$assign             = "SPIB";
spi3.spi.spi_picoPin.$assign = "GPIO60";
spi3.spi.spi_pociPin.$assign = "GPIO61";
spi3.spi.spi_clkPin.$assign  = "GPIO58";
spi3.picoQual.$name          = "myGPIOQUAL8";
spi3.pociQual.$name          = "myGPIOQUAL9";
spi3.clkQual.$name           = "myGPIOQUAL10";
spi3.clkQual.padConfig       = "PULLUP";
spi3.pteQual.$name           = "myGPIOQUAL11";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
sci3.sci.scirxdPin.$suggestSolution  = "GPIO11";
sci3.sci.scitxdPin.$suggestSolution  = "GPIO10";
spi1.spi.spi_ptePin.$suggestSolution = "GPIO72";
spi2.spi.spi_ptePin.$suggestSolution = "GPIO57";
spi3.spi.spi_ptePin.$suggestSolution = "GPIO23";
